# HasExternalGeometry Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeType..::..HasExternalGeometry Method
DirectShapeType Class See Also
---
Checks whether the externally tagged geometry is already present in this DirectShapeType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool HasExternalGeometry(
	ExternalGeometryId externalId
)
```

Visual Basic
---
```text
Public Function HasExternalGeometry ( _
	externalId As ExternalGeometryId _
) As Boolean
```

Visual C++
---
```text
public:
bool HasExternalGeometry(
	ExternalGeometryId^ externalId
)
```

# ### Parameters
externalId
    Type: Autodesk.Revit.DB..::..ExternalGeometryId The external ID of the externally tagged geometry to check.
# ### Return Value
True if such an externally tagged geometry is already present in this DirectShapeType, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace